icosalogic/SAMD51_Dumpster/SAMD51_Dumpster.cpp
/*
 * Dump routines for some low level SAMD51 hardware components.
 */

#include "SAMD51_Dumpster.h"
#include "portmux.h"


SAMD51_Dumpster::SAMD51_Dumpster() {
}


/*
 * Sets the flag that controls printing of disabled entries.  By default,
 * only enabled entries are printed.  Passing in a value > 0 will cause
 * disabled entries to be printed, too.
 */
void SAMD51_Dumpster::begin(int verbose) {
  this->verbose = verbose;
}

/*
 * Dump all the port groups configured for this microprocessor instance.
 */
void SAMD51_Dumpster::dumpPort(const char* msg) {
  Serial.printf("\nPORT:");
  if (msg != NULL) {
    Serial.printf(" %s", msg);
  }
  Serial.printf("\n");
  
  for (int i = 0; i < PORT_GROUPS; i++) {
    dumpPortGroup(i);
  }
}

/*
 * Dump a port group of 32 ports.
 */
void SAMD51_Dumpster::dumpPortGroup(int groupNum) {
  const char* groupName[4] = {"A", "B", "C", "D"};
  const char* evAct[4] = {"OUT", "SET", "CLR", "TGL"};
  PortGroup* pg = &(PORT->Group[groupNum]);

  uint32_t dir    = pg->DIR.reg;
  uint32_t out    = pg->OUT.reg;
  uint32_t in     = pg->IN.reg;
  uint32_t sample = pg->CTRL.reg;
  const char* gName = groupName[groupNum];
  Serial.printf("PORT GROUP %d %s 0x%x\n", groupNum, gName, pg);
  PORT_EVCTRL_Type evctrl;
  evctrl.reg = pg->EVCTRL.reg;
  Serial.printf("    EVCTRL 0: portei=%d evact=%d [%s] %d\n",
                evctrl.bit.PORTEI0, evctrl.bit.EVACT0, evAct[evctrl.bit.EVACT0], evctrl.bit.PID0);
  Serial.printf("           1: portei=%d evact=%d [%s] %d\n",
                evctrl.bit.PORTEI1, evctrl.bit.EVACT1, evAct[evctrl.bit.EVACT1], evctrl.bit.PID1);
  Serial.printf("           2: portei=%d evact=%d [%s] %d\n",
                evctrl.bit.PORTEI2, evctrl.bit.EVACT2, evAct[evctrl.bit.EVACT2], evctrl.bit.PID2);
  Serial.printf("           3: portei=%d evact=%d [%s] %d\n",
                evctrl.bit.PORTEI3, evctrl.bit.EVACT3, evAct[evctrl.bit.EVACT3], evctrl.bit.PID3);
  
  // display 2 ports per iteration, so we can increment the mux index once
  int muxNum = 0;
  for (int portNum = 0; portNum < 32; portNum++) {
    PORT_PMUX_Type mux;
    mux.reg = pg->PMUX[muxNum].reg;
    PORT_PINCFG_Type cfg;
    cfg.reg = pg->PINCFG[portNum].reg;
    Serial.printf("    P%s%02d: dir=%d out=%d in=%d sample=%d mux=%d ",
                  gName, portNum, dir & 1, out & 1, in & 1, sample & 1, mux.bit.PMUXE);
    Serial.printf("pmuxen=%d inen=%d pullen=%d drvstr=%d",
                  cfg.bit.PMUXEN, cfg.bit.INEN, cfg.bit.PULLEN, cfg.bit.DRVSTR);
    if (cfg.bit.PMUXEN) {
      Serial.printf(" %s", getPortMuxUserName(portNum, mux.bit.PMUXE));
    }
    Serial.printf("\n");
    dir    >>= 1;
    out    >>= 1;
    in     >>= 1;
    sample >>= 1;
    
    portNum += 1;
    muxNum += 1;
    
    cfg.reg = pg->PINCFG[portNum].reg;
    Serial.printf("    P%s%02d: dir=%d out=%d in=%d sample=%d mux=%d ",
                  gName, portNum, dir & 1, out & 1, in & 1, sample & 1, mux.bit.PMUXO);
    Serial.printf("pmuxen=%d inen=%d pullen=%d drvstr=%d",
                  cfg.bit.PMUXEN, cfg.bit.INEN, cfg.bit.PULLEN, cfg.bit.DRVSTR);
    if (cfg.bit.PMUXEN) {
      Serial.printf(" mux_user=%s", getPortMuxUserName(portNum, mux.bit.PMUXO));
    }
    Serial.printf("\n");
    dir    >>= 1;
    out    >>= 1;
    in     >>= 1;
    sample >>= 1;
  }
  Serial.printf("\n");
}


/*
 * Dumps the GCLK entries.
 */
void SAMD51_Dumpster::dumpGCLK(const char* msg) {
  Serial.printf("\nGCLK:");
  if (msg != NULL) {
    Serial.printf(" %s", msg);
  }
  Serial.printf("\n");
  
  // check SYNCBUSY?
  uint8_t tmp8 = REG_GCLK_CTRLA;
  Serial.printf("  CTRLA=0X%02x (SWRST=%d)\n", tmp8, tmp8 & 0x1);
  uint16_t tmp16 = REG_GCLK_SYNCBUSY;
  Serial.printf("  SYNCBUSY=0x%x\n", tmp16);
  
  dumpGCLKGenerators();
  
  Serial.println(" ");
  
  dumpGCLKUsers();
  
  Serial.printf("\n");
}

/*
 * Dumps all the GCLK generator entries.
 */
void SAMD51_Dumpster::dumpGCLKGenerators() {
  for (int i = 0; i < GCLK_GEN_NUM; i++) {
    dumpGclkGenctrl(i);
  }
}

/*
 * Dumps all the GCLK user entries.
 */
void SAMD51_Dumpster::dumpGCLKUsers() {
  for (int i = 0; i < GCLK_NUM; i++) {
    dumpGclkPchctrl(i);
  }
}

/*
 * Dumps a single GCLK generator entry.
 * 
 * N.B.: Max div is 512, except for GCLK1, where it is 131072.
 */
void SAMD51_Dumpster::dumpGclkGenctrl(int n) {
  GCLK_GENCTRL_Type genctrl;
  genctrl.reg = GCLK->GENCTRL[n].reg;
  
  if (genctrl.bit.GENEN || verbose) {
    Serial.printf("  GENCTRL%d=0x%x (src=%d [%s] genen=%d idc=%d ",
                  n, genctrl.reg, genctrl.bit.SRC, gclkSrcName[genctrl.bit.SRC], genctrl.bit.GENEN,
                  genctrl.bit.IDC);
    Serial.printf("oov=%d oe=%d divsel=%d runstdby=%d div=%d)\n",
                  genctrl.bit.OOV, genctrl.bit.OE, genctrl.bit.DIVSEL,
                  genctrl.bit.RUNSTDBY, genctrl.bit.DIV);
  }
}

/*
 * Dumps a single GCLK peripheral channel entry (aka user entry).
 */
void SAMD51_Dumpster::dumpGclkPchctrl(int n) {
  GCLK_PCHCTRL_Type pchctrl;
  pchctrl.reg = GCLK->PCHCTRL[n].reg;
  if (pchctrl.bit.CHEN || verbose) {
    Serial.printf("  PCHCTRL%d=0x%02x (gen=%d chen=%d wrtlock=%d) [%s]\n",
                  n, pchctrl.reg, pchctrl.bit.GEN, pchctrl.bit.CHEN, pchctrl.bit.WRTLOCK,
                  gclkUserName[n]);
  }
}


/*
 * Dump the MCLK flags.
 * 
 * TODO: Finish this implementation.  Not turning on the MCLK for a
 *       peripheral is a common problem.
 */
void SAMD51_Dumpster::dumpMCLK(const char* msg) {
  Serial.printf("\nMCLK:");
  if (msg != NULL) {
    Serial.printf(" %s", msg);
  }
  Serial.printf("\n");
  MCLK_INTENSET_Type intenset;
  MCLK_INTFLAG_Type intflag;
  intenset.reg = REG_MCLK_INTENSET;
  intflag.reg = REG_MCLK_INTFLAG;
  uint8_t hsdiv = REG_MCLK_HSDIV;
  uint8_t cpudiv = REG_MCLK_CPUDIV;
  Serial.printf("  intenset.ckrdy=%d intflag.ckrdy=%d hsdiv=0x%02x (%d) cpudiv=0x%02x (%d)\n",
                intenset.bit.CKRDY, intflag.bit.CKRDY, hsdiv, hsdiv, cpudiv, cpudiv);
  
  dumpMclkAHB();
  dumpMclkAPBA();
  dumpMclkAPBB();
  dumpMclkAPBC();
  dumpMclkAPBD();
}

