icosalogic/SAMD51_Dumpster/SAMD51_Dumpster.cpp
/*
 * Dump the AHB MCLK configuration register.
 */
void SAMD51_Dumpster::dumpMclkAHB() {
  MCLK_AHBMASK_Type ahb;
  ahb.reg = REG_MCLK_AHBMASK;
  
  // No CAN0/1 or GMAC for SAMD51
  Serial.printf("  AHB:  0x%06x hpb0[APBA]=%d hpb1[APBB]=%d hpb2[APBC]=%d hpb3[APBD]=%d dsu=%d ",
                ahb.reg, ahb.bit.HPB0_, ahb.bit.HPB1_, ahb.bit.HPB2_, ahb.bit.HPB3_,
                ahb.bit.DSU_);
  Serial.printf("nvmctrl=%d cmcc=%d dmac=%d usb=%d\n",
                ahb.bit.NVMCTRL_, ahb.bit.CMCC_, ahb.bit.DMAC_, ahb.bit.USB_);
  Serial.printf("                 pac=%d qspi=%d sdhc0=%d sdhc1=%d icm=%d ",
                ahb.bit.PAC_, ahb.bit.QSPI_, ahb.bit.SDHC0_, ahb.bit.SDHC1_, ahb.bit.ICM_);
  Serial.printf("pukcc=%d qspi2x=%d nvmctrl_smeeprom=%d nvmctrl_cache=%d\n",
                ahb.bit.PUKCC_, ahb.bit.QSPI_2X_, ahb.bit.NVMCTRL_SMEEPROM_, ahb.bit.NVMCTRL_CACHE_);
}

/*
 * Dump the APBA MCLK configuration register.
 */
void SAMD51_Dumpster::dumpMclkAPBA() {
  MCLK_APBAMASK_Type apba;
  apba.reg = REG_MCLK_APBAMASK;
  Serial.printf("  APBA: 0x%06x pac=%d pm=%d mclk=%d rstc=%d oscctrl=%d osc32kctrl=%d supc=%d ",
                apba.reg, apba.bit.PAC_, apba.bit.PM_, apba.bit.MCLK_, apba.bit.RSTC_, apba.bit.OSCCTRL_,
                apba.bit.OSC32KCTRL_, apba.bit.SUPC_);
  Serial.printf("gclk=%d wdt=%d rtc=%d eic=%d freqm=%d sercom0=%d sercom1=%d tc0=%d tc1=%d\n",
                apba.bit.GCLK_, apba.bit.WDT_, apba.bit.RTC_, apba.bit.EIC_, apba.bit.FREQM_,
                apba.bit.SERCOM0_, apba.bit.SERCOM1_, apba.bit.TC0_, apba.bit.TC1_);
}

/*
 * Dump the APBB MCLK configuration register.
 */
void SAMD51_Dumpster::dumpMclkAPBB() {
  MCLK_APBBMASK_Type apbb;
  apbb.reg = REG_MCLK_APBBMASK;
  Serial.printf("  APBB: 0x%06x usb=%d dsu=%d nvmctrl=%d port=%d evsys=%d sercom2=%d sercom3=%d ",
                apbb.reg, apbb.bit.USB_, apbb.bit.DSU_, apbb.bit.NVMCTRL_, apbb.bit.PORT_,
                apbb.bit.EVSYS_, apbb.bit.SERCOM2_, apbb.bit.SERCOM3_);
  Serial.printf("tcc0=%d tcc1=%d tc2=%d tc3=%d ramecc=%d\n",
                apbb.bit.TCC0_, apbb.bit.TCC1_, apbb.bit.TC2_, apbb.bit.TC3_, apbb.bit.RAMECC_);
}

/*
 * Dump the APBC MCLK configuration register.
 */
void SAMD51_Dumpster::dumpMclkAPBC() {
  MCLK_APBCMASK_Type apbc;
  apbc.reg = REG_MCLK_APBCMASK;
  Serial.printf("  APBC: 0x%06x tcc2=%d tcc3=%d tc4=%d tc5=%d pdec=%d ac=%d aes=%d trng=%d ",
                apbc.reg, apbc.bit.TCC2_, apbc.bit.TCC3_, apbc.bit.TC4_,
                apbc.bit.TC5_, apbc.bit.PDEC_, apbc.bit.AC_, apbc.bit.AES_, apbc.bit.TRNG_);
  Serial.printf("icm=%d qspi=%d ccl=%d\n",
                apbc.bit.ICM_, apbc.bit.QSPI_, apbc.bit.CCL_);
}


/*
 * Dump the APBD MCLK configuration register.
 */
void SAMD51_Dumpster::dumpMclkAPBD() {
  MCLK_APBDMASK_Type apbd;
  apbd.reg = REG_MCLK_APBDMASK;
  Serial.printf("  APBD: 0x%06x sercom4=%d sercom5=%d sercom6=%d sercom7=%d tcc4=%d tc6=%d tc7=%d ",
                apbd.reg, apbd.bit.SERCOM4_, apbd.bit.SERCOM5_, apbd.bit.SERCOM6_, apbd.bit.SERCOM7_,
                apbd.bit.TCC4_, apbd.bit.TC6_, apbd.bit.TC7_);
  Serial.printf("adc0=%d adc1=%d dac=%d i2s=%d pcc=%d\n",
                apbd.bit.ADC0_, apbd.bit.ADC1_, apbd.bit.DAC_, apbd.bit.I2S_, apbd.bit.PCC_);
}

/*
 * Dumps all the SERCOM instances.
 * 
 * Documentation page numbers for SERCOM register descriptions:
 * UART: 851
 * SPI:  889
 * I2C:  928
 */
void SAMD51_Dumpster::dumpSERCOM(const char* msg) {
  Serial.printf("\nSERCOM:");
  if (msg != NULL) {
    Serial.printf(" %s", msg);
  }
  Serial.printf("\n");
  
  for (int i = 0; i < SERCOM_INST_NUM; i++) {
    dumpSercomInstance(i);
  }
}

/*
 * Dumps the given SERCOM instance number.
 */
void SAMD51_Dumpster::dumpSercomInstance(int n) {
  if (n < 0 || n >= SERCOM_INST_NUM) {
    return;
  }
  Sercom* instances[SERCOM_INST_NUM] = SERCOM_INSTS;
  Sercom* sc = instances[n];
    
  bool myVerbose = verbose;
  
  if (sc->SPI.CTRLA.bit.ENABLE || myVerbose) {
    switch (sc->SPI.CTRLA.bit.MODE) {
      case 0:  // USART with external clock
      case 1:  // USART with internal clock
        Serial.printf("SERCOM%d: USART 0x%x\n", n, sc);
        dumpSercomUsart(sc);
        break;
      case 2:  // SPI peripheral
      case 3:  // SPI controller
        Serial.printf("SERCOM%d: SPI 0x%x\n", n, sc);
        dumpSercomSpi(sc);
        break;
      case 4:  // I2C peripheral
        Serial.printf("SERCOM%d: I2CS 0x%x\n", n, sc);
        dumpSercomI2cs(sc);
        break;
      case 5:  // I2C controller
        Serial.printf("SERCOM%d: I2CM 0x%x\n", n, sc);
        dumpSercomI2cm(sc);
        break;
      default:
        Serial.printf("SERCOM%d: invalid mode=%d\n",
                      n, sc->SPI.CTRLA.bit.MODE);
        break;
    }
  Serial.printf("\n");
  }
}

/*
 * Dump a SERCOM/USART object.
 */
void SAMD51_Dumpster::dumpSercomUsart(Sercom* sc) {
  SERCOM_USART_CTRLA_Type ctrla;
  ctrla.reg = sc->USART.CTRLA.reg;
  Serial.printf("  CTRLA: 0x%x swrst %d enable %d mode %d runstdby %d ",
                ctrla.reg, ctrla.bit.SWRST, ctrla.bit.ENABLE, ctrla.bit.MODE, ctrla.bit.RUNSTDBY);
  Serial.printf("ibon=%d txinv=%d rxinv=%d sampr=%d\n",
                ctrla.bit.IBON, ctrla.bit.TXINV, ctrla.bit.RXINV, ctrla.bit.SAMPR);
  Serial.printf("         txpo=%d rxpo=%d sampa=%d form=%d cmode=%d cpol=%d dord=%d\n",
                ctrla.bit.TXPO, ctrla.bit.RXPO, ctrla.bit.SAMPA, ctrla.bit.FORM,
                ctrla.bit.CMODE, ctrla.bit.CPOL, ctrla.bit.DORD);
                
  SERCOM_USART_CTRLB_Type ctrlb;
  ctrlb.reg = sc->USART.CTRLB.reg;
  Serial.printf("  CTRLB: 0x%x chsize=%d [%s] sbmode=%d [%dbit] colden=%d ",
                ctrlb.reg, ctrlb.bit.CHSIZE, usartChsize[ctrlb.bit.CHSIZE], ctrlb.bit.SBMODE,
                ctrlb.bit.SBMODE + 1, ctrlb.bit.COLDEN);
  Serial.printf("sfde=%d enc=%d pmode=%d [%s] txen=%d rxen=%d lincmd=%d\n",
                ctrlb.bit.SFDE, ctrlb.bit.ENC, ctrlb.bit.PMODE, usartPmode[ctrlb.bit.PMODE],
                ctrlb.bit.TXEN, ctrlb.bit.RXEN, ctrlb.bit.LINCMD);
  
