icosalogic/SAMD51_Dumpster/SAMD51_Dumpster.cpp
  SERCOM_USART_CTRLC_Type ctrlc;
  ctrlc.reg = sc->USART.CTRLC.reg;
  Serial.printf("  CTRLC: 0x%x gtime=%d brklen=%d hdrdly=%d ",
                ctrlc.reg, ctrlc.bit.GTIME, ctrlc.bit.BRKLEN, ctrlc.bit.HDRDLY);
  Serial.printf("inack=%d dsnack=%d maxiter=%d data32b=%d\n", 
                ctrlc.bit.INACK, ctrlc.bit.DSNACK, ctrlc.bit.MAXITER, ctrlc.bit.DATA32B);
  
  SERCOM_USART_BAUD_Type baud;
  baud.reg = sc->USART.BAUD.reg;
  Serial.printf("  BAUD: 0x%x (%d) (%d.%d)\n", baud.reg, baud.reg, baud.FRAC.BAUD, baud.FRAC.FP);
  
  Serial.printf("  RXPL: 0x%x (%d)\n", sc->USART.RXPL.reg, sc->USART.RXPL.reg);
  
  SERCOM_USART_INTENSET_Type intenset;
  intenset.reg = sc->USART.INTENSET.reg;
  Serial.printf("  INTENSET: 0x%x dre=%d txc=%d rxc=%d rxs=%d ctsic=%d rxbrk=%d error=%d\n",
                intenset.reg, intenset.bit.DRE, intenset.bit.TXC, intenset.bit.RXC,
                intenset.bit.RXS, intenset.bit.CTSIC, intenset.bit.RXBRK, intenset.bit.ERROR);
  
  SERCOM_USART_INTFLAG_Type intflag;
  intflag.reg = sc->USART.INTFLAG.reg;
  Serial.printf("  INTFLAG: 0x%x dre=%d txc=%d rxc=%d rxs=%d ctsic=%d rxbrk=%d error=%d\n",
                intflag.reg, intflag.bit.DRE, intflag.bit.TXC, intflag.bit.RXC,
                intflag.bit.RXS, intflag.bit.CTSIC, intflag.bit.RXBRK, intflag.bit.ERROR);
  
  SERCOM_USART_STATUS_Type status;
  status.reg = sc->USART.STATUS.reg;
  Serial.printf("  STATUS: 0x%x perr=%d ferr=%d bufovf=%d cts=%d isf=%d coll=%d txe=%d iter=%d\n",
                status.reg, status.bit.PERR, status.bit.FERR, status.bit.BUFOVF, status.bit.CTS,
                status.bit.ISF, status.bit.COLL, status.bit.TXE, status.bit.ITER);
  
  SERCOM_USART_SYNCBUSY_Type sb;
  sb.reg = sc->USART.SYNCBUSY.reg;
  Serial.printf("  SYNCBUSY: 0x%x swrst=%d enable=%d ctrlb=%d rxerrcnt=%d length=%d\n",
                sb.reg, sb.bit.SWRST, sb.bit.ENABLE, sb.bit.CTRLB, sb.bit.RXERRCNT, sb.bit.LENGTH);
  
  Serial.printf("  RXERRCNT: 0x%x (%d)\n", sc->USART.RXERRCNT.reg, sc->USART.RXERRCNT.reg);
  
  SERCOM_USART_LENGTH_Type len;
  len.reg = sc->USART.LENGTH.reg;
  Serial.printf("  LENGTH: 0x%x length=%d lenen=%d\n", len.reg, len.bit.LEN, len.bit.LENEN);
  
  SERCOM_USART_DATA_Type data;
  data.reg = sc->USART.DATA.reg;
  Serial.printf("  DATA: 0x%x (%d)\n", data.reg, data.reg);
  
  Serial.printf("  DBGCTRL: 0x%x dbgstop=%d\n", sc->USART.DBGCTRL.reg, sc->USART.DBGCTRL.bit.DBGSTOP);
}

/*
 * Dump a SERCOM/SPI object.
 */
void SAMD51_Dumpster::dumpSercomSpi(Sercom* sc) {
  SERCOM_SPI_CTRLA_Type ctrla;
  ctrla.reg = sc->SPI.CTRLA.reg;
  Serial.printf("  CTRLA: 0x%x swrst %d enable %d mode %d runstdby %d ",
                ctrla.reg, ctrla.bit.SWRST, ctrla.bit.ENABLE, ctrla.bit.MODE, ctrla.bit.RUNSTDBY);
  Serial.printf("ibon=%d dopo=%d dipo=%d\n",
                ctrla.bit.IBON, ctrla.bit.DOPO, ctrla.bit.DIPO);
  Serial.printf("         form=%d cpha=%d cpol=%d dord=%d\n",
                ctrla.bit.FORM, ctrla.bit.CPHA, ctrla.bit.CPOL, ctrla.bit.DORD);
                
  SERCOM_SPI_CTRLB_Type ctrlb;
  ctrlb.reg = sc->SPI.CTRLB.reg;
  Serial.printf("  CTRLB: 0x%x chsize=%d [%s] ploaden=%d ssde=%d mssen=%d amode=%d rxen=%d\n",
                ctrlb.reg, ctrlb.bit.CHSIZE, usartChsize[ctrlb.bit.CHSIZE], ctrlb.bit.PLOADEN,
                ctrlb.bit.SSDE, ctrlb.bit.MSSEN, ctrlb.bit.AMODE, ctrlb.bit.RXEN);
  
  SERCOM_SPI_CTRLC_Type ctrlc;
  ctrlc.reg = sc->SPI.CTRLC.reg;
  Serial.printf("  CTRLC: 0x%x icspace=%d data32b=%d\n", 
                ctrlc.reg, ctrlc.bit.ICSPACE, ctrlc.bit.DATA32B);
  
  SERCOM_SPI_BAUD_Type baud;
  baud.reg = sc->SPI.BAUD.reg;
  Serial.printf("  BAUD: 0x%x (%d)\n", baud.reg, baud.reg);
  
  SERCOM_SPI_INTENSET_Type intenset;
  intenset.reg = sc->SPI.INTENSET.reg;
  Serial.printf("  INTENSET: 0x%x dre=%d txc=%d rxc=%d ssl=%d error=%d\n",
                intenset.reg, intenset.bit.DRE, intenset.bit.TXC, intenset.bit.RXC,
                intenset.bit.SSL, intenset.bit.ERROR);
  
  SERCOM_SPI_INTFLAG_Type intflag;
  intflag.reg = sc->SPI.INTFLAG.reg;
  Serial.printf("  INTFLAG: 0x%x dre=%d txc=%d rxc=%d ssl=%d error=%d\n",
                intflag.reg, intflag.bit.DRE, intflag.bit.TXC, intflag.bit.RXC,
                intflag.bit.SSL, intflag.bit.ERROR);
  
  SERCOM_SPI_STATUS_Type status;
  status.reg = sc->SPI.STATUS.reg;
  Serial.printf("  STATUS: 0x%x bufovf=%d lenerr=%d\n",
                status.reg, status.bit.BUFOVF, status.bit.LENERR);
  
  SERCOM_SPI_SYNCBUSY_Type sb;
  sb.reg = sc->SPI.SYNCBUSY.reg;
  Serial.printf("  SYNCBUSY: 0x%x swrst=%d enable=%d ctrlb=%d length=%d\n",
                sb.reg, sb.bit.SWRST, sb.bit.ENABLE, sb.bit.CTRLB, sb.bit.LENGTH);
  
  SERCOM_SPI_LENGTH_Type len;
  len.reg = sc->SPI.LENGTH.reg;
  Serial.printf("  LENGTH: 0x%x length=%d lenen=%d\n", len.reg, len.bit.LEN, len.bit.LENEN);
  
  SERCOM_SPI_ADDR_Type addr;
  addr.reg = sc->SPI.ADDR.reg;
  Serial.printf("  ADDR: 0x%x addr 0x%x (%d) addrmask 0x%x (%d)\n",
                addr.reg, addr.bit.ADDR, addr.bit.ADDR, addr.bit.ADDRMASK, addr.bit.ADDRMASK);
  
  SERCOM_SPI_DATA_Type data;
  data.reg = sc->SPI.DATA.reg;
  Serial.printf("  DATA: 0x%x (%d)\n", data.reg, data.reg);
  
  Serial.printf("  DBGCTRL: 0x%x dbgstop=%d\n", sc->SPI.DBGCTRL.reg, sc->SPI.DBGCTRL.bit.DBGSTOP);
}

/*
 * Dump a SERCOM/I2C server peripheral instance.
 */
void SAMD51_Dumpster::dumpSercomI2cs(Sercom* sc) {
  SERCOM_I2CS_CTRLA_Type ctrla;
  ctrla.reg = sc->I2CS.CTRLA.reg;
  Serial.printf("  CTRLA: 0x%x swrst %d enable %d mode %d runstdby %d ",
                ctrla.reg, ctrla.bit.SWRST, ctrla.bit.ENABLE, ctrla.bit.MODE, ctrla.bit.RUNSTDBY);
  Serial.printf("pinout=%d sdahold=%d \n", ctrla.bit.PINOUT, ctrla.bit.SDAHOLD);
  Serial.printf("         sexttoen=%d speed=%d sclsm=%d lowtouten=%d\n",
                ctrla.bit.SEXTTOEN, ctrla.bit.SPEED, ctrla.bit.SCLSM, ctrla.bit.LOWTOUTEN);
                
  SERCOM_I2CS_CTRLB_Type ctrlb;
  ctrlb.reg = sc->I2CS.CTRLB.reg;
  Serial.printf("  CTRLB: 0x%x smen=%d gcmd=%d aacken=%d amode=%d cmd=%d ackact=%d\n",
                ctrlb.reg, ctrlb.bit.SMEN, ctrlb.bit.GCMD,
                ctrlb.bit.AACKEN, ctrlb.bit.AMODE, ctrlb.bit.CMD, ctrlb.bit.ACKACT);
  
  SERCOM_I2CS_CTRLC_Type ctrlc;
  ctrlc.reg = sc->I2CS.CTRLC.reg;
  Serial.printf("  CTRLC: 0x%x sdasetup=%d data32b=%d\n", 
                ctrlc.reg, ctrlc.bit.SDASETUP, ctrlc.bit.DATA32B);
  
  SERCOM_I2CS_INTENSET_Type intenset;
  intenset.reg = sc->I2CS.INTENSET.reg;
  Serial.printf("  INTENSET: 0x%x prec=%d amatch=%d drdy=%d error=%d\n",
                intenset.reg, intenset.bit.PREC, intenset.bit.AMATCH, intenset.bit.DRDY,
                intenset.bit.ERROR);
  
  SERCOM_I2CS_INTFLAG_Type intflag;
  intflag.reg = sc->I2CS.INTFLAG.reg;
  Serial.printf("  INTFLAG: 0x%x prec=%d amatch=%d drdy=%d error=%d\n",
                intflag.reg, intflag.bit.PREC, intflag.bit.AMATCH, intflag.bit.DRDY,
                intflag.bit.ERROR);
  
  SERCOM_I2CS_STATUS_Type status;
  status.reg = sc->I2CS.STATUS.reg;
  Serial.printf("  STATUS: 0x%x buserr=%d coll=%d rxnack=%d dir=%d sr=%d ",
                status.reg, status.bit.BUSERR, status.bit.COLL, status.bit.RXNACK,
                status.bit.DIR, status.bit.SR);
  Serial.printf("lowtout=%d clkhold=%d sexttout=%d hs=%d lenerr=%d\n",
                status.bit.LOWTOUT, status.bit.CLKHOLD, status.bit.SEXTTOUT,
                status.bit.HS, status.bit.LENERR);
  
  SERCOM_I2CS_SYNCBUSY_Type sb;
  sb.reg = sc->I2CS.SYNCBUSY.reg;
  Serial.printf("  SYNCBUSY: 0x%x swrst=%d enable=%d length=%d\n",
                sb.reg, sb.bit.SWRST, sb.bit.ENABLE, sb.bit.LENGTH);
  
  SERCOM_I2CS_LENGTH_Type len;
  len.reg = sc->I2CS.LENGTH.reg;
  Serial.printf("  LENGTH: 0x%x length=%d lenen=%d\n", len.reg, len.bit.LEN, len.bit.LENEN);
  
  SERCOM_I2CS_ADDR_Type addr;
  addr.reg = sc->I2CS.ADDR.reg;
  Serial.printf("  ADDR: 0x%x gencen=%d addr 0x%x (%d) tenbiten=%d addrmask 0x%x (%d)\n",
                addr.reg, addr.bit.GENCEN, addr.bit.ADDR, addr.bit.ADDR, addr.bit.TENBITEN,
                addr.bit.ADDRMASK, addr.bit.ADDRMASK);
  
  SERCOM_I2CS_DATA_Type data;
  data.reg = sc->I2CS.DATA.reg;
  Serial.printf("  DATA: 0x%x (%d)\n", data.reg, data.reg);
}

