icosalogic/SAMD51_Dumpster/SAMD51_Dumpster.cpp
/*
 * Dump a SERCOM/I2C controller instance.
 */
void SAMD51_Dumpster::dumpSercomI2cm(Sercom* sc) {
  SERCOM_I2CM_CTRLA_Type ctrla;
  ctrla.reg = sc->I2CM.CTRLA.reg;
  Serial.printf("  CTRLA: 0x%x swrst %d enable %d mode %d runstdby %d ",
                ctrla.reg, ctrla.bit.SWRST, ctrla.bit.ENABLE, ctrla.bit.MODE, ctrla.bit.RUNSTDBY);
  Serial.printf("pinout=%d sdahold=%d \n", ctrla.bit.PINOUT, ctrla.bit.SDAHOLD);
  Serial.printf("         mexttoen=%d sexttoen=%d speed=%d sclsm=%d inactout=%d lowtouten=%d\n",
                ctrla.bit.MEXTTOEN, ctrla.bit.SEXTTOEN, ctrla.bit.SPEED, ctrla.bit.SCLSM,
                ctrla.bit.INACTOUT, ctrla.bit.LOWTOUTEN);
                
  SERCOM_I2CM_CTRLB_Type ctrlb;
  ctrlb.reg = sc->I2CM.CTRLB.reg;
  Serial.printf("  CTRLB: 0x%x smen=%d qcen=%d cmd=%d ackact=%d\n",
                ctrlb.reg, ctrlb.bit.SMEN, ctrlb.bit.QCEN, ctrlb.bit.CMD, ctrlb.bit.ACKACT);
  
  SERCOM_I2CM_CTRLC_Type ctrlc;
  ctrlc.reg = sc->I2CM.CTRLC.reg;
  Serial.printf("  CTRLC: 0x%x  data32b=%d\n", ctrlc.reg, ctrlc.bit.DATA32B);
  
  SERCOM_I2CM_BAUD_Type baud;
  baud.reg = sc->I2CM.BAUD.reg;
  Serial.printf("  BAUD: 0x%x baud=%d baudlow=%d hsbaud=%d hsbaudlow=%d\n",
                baud.reg, baud.bit.BAUD, baud.bit.BAUDLOW, baud.bit.HSBAUD, baud.bit.HSBAUDLOW);
  
  SERCOM_I2CM_INTENSET_Type intenset;
  intenset.reg = sc->I2CM.INTENSET.reg;
  Serial.printf("  INTENSET: 0x%x mb=%d sb=%d error=%d\n",
                intenset.reg, intenset.bit.MB, intenset.bit.SB, intenset.bit.ERROR);
  
  SERCOM_I2CM_INTFLAG_Type intflag;
  intflag.reg = sc->I2CM.INTFLAG.reg;
  Serial.printf("  INTFLAG: 0x%x mb=%d sb=%d error=%d\n",
                intflag.reg, intflag.bit.MB, intflag.bit.SB, intflag.bit.ERROR);
  
  SERCOM_I2CM_STATUS_Type status;
  status.reg = sc->I2CM.STATUS.reg;
  Serial.printf("  STATUS: 0x%x buserr=%d arblost=%d rxnack=%d busstate=%d [%s] ",
                status.reg, status.bit.BUSERR, status.bit.ARBLOST, status.bit.RXNACK,
                status.bit.BUSSTATE, i2cmBusState[status.bit.BUSSTATE]);
  Serial.printf("lowtout=%d clkhold=%d mexttout=%d sexttout=%d lenerr=%d\n",
                status.bit.LOWTOUT, status.bit.CLKHOLD, status.bit.MEXTTOUT,
                status.bit.SEXTTOUT, status.bit.LENERR);
  
  SERCOM_I2CM_SYNCBUSY_Type sb;
  sb.reg = sc->I2CM.SYNCBUSY.reg;
  Serial.printf("  SYNCBUSY: 0x%x swrst=%d enable=%d sysop=%d\n",
                sb.reg, sb.bit.SWRST, sb.bit.ENABLE, sb.bit.SYSOP);
  
  SERCOM_I2CM_ADDR_Type addr;
  addr.reg = sc->I2CM.ADDR.reg;
  Serial.printf("  ADDR: 0x%x addr 0x%x (%d) lenen=%d hs=%d tenbiten=%d len=%d\n",
                addr.reg, addr.bit.ADDR, addr.bit.ADDR, addr.bit.LENEN,
                addr.bit.HS, addr.bit.TENBITEN, addr.bit.LEN);
  
  SERCOM_I2CM_DATA_Type data;
  data.reg = sc->I2CM.DATA.reg;
  Serial.printf("  DATA: 0x%x (%d)\n", data.reg, data.reg);
  
  Serial.printf("  DBGCTRL: 0x%x dbgstop=%d\n", sc->I2CM.DBGCTRL.reg, sc->I2CM.DBGCTRL.bit.DBGSTOP);
}

/*
 * Dumps all the TCC instances.
 */
void SAMD51_Dumpster::dumpTCC(const char* msg) {
  Serial.printf("\nTCC:");
  if (msg != NULL) {
    Serial.printf(" %s", msg);
  }
  Serial.printf("\n");
  
  for (int i = 0; i < TCC_INST_NUM; i++) {
    dumpTccInstance(i);
  }
}

/*
 * Gets a pointer to the given TCC instance number, and calls the method for dumping
 * that revision of TCC instance.  This allows handling the various flavors of TCC
 * instances that have existed over the evolution of SAM processors.
 */
void SAMD51_Dumpster::dumpTccInstance(int n) {
  Tcc* instances[] = TCC_INSTS;
  Tcc* tcc = instances[n];
  int ccNum = tccCcNum[n];
  
  if (tcc->CTRLA.bit.ENABLE || verbose) {

    Serial.printf("TCC%d: ", n);
    
#if REV_TCC == 0x310
    dumpTccInstance310(tcc, ccNum);
#else
    Serial.printf("TCC version 0x%x not supported\n", REV_TCC);
#endif

  }
}

#if REV_TCC == 0x310
void SAMD51_Dumpster::dumpTccInstance310(Tcc* tcc, int ccNum) {
  int prescalerVal[] = {1, 2, 4, 8, 16, 64, 256, 1024};
  TCC_CTRLA_Type ctrla;
  ctrla.reg = tcc->CTRLA.reg;

  Serial.printf("CTRLA=0x%x swrst=%d en=%d eres=%d ",
                ctrla.reg, ctrla.bit.SWRST, ctrla.bit.ENABLE, ctrla.bit.RESOLUTION);
  Serial.printf("prescaler=%d [div %d] runstdby=%d prescsync=%d ",
                ctrla.bit.PRESCALER, prescalerVal[ctrla.bit.PRESCALER], ctrla.bit.RUNSTDBY,
                ctrla.bit.PRESCSYNC);
  Serial.printf("alock=%d msync=%d dmaos=%d cpten=[%d,%d,%d,%d,%d,%d]\n",
                ctrla.bit.ALOCK, ctrla.bit.MSYNC, ctrla.bit.DMAOS, ctrla.bit.CPTEN0,
                ctrla.bit.CPTEN1, ctrla.bit.CPTEN2, ctrla.bit.CPTEN3, ctrla.bit.CPTEN4,
                ctrla.bit.CPTEN5);
                
  TCC_CTRLBSET_Type ctrlb;
  ctrlb.reg = tcc->CTRLBSET.reg;
  Serial.printf("      CTRLB=0x%x dir=%d [%s] lupd=%d oneshot=%d idxcmd=%d cmd=%d\n",
                ctrlb.reg, ctrlb.bit.DIR, ctrlb.bit.DIR == 0 ? "+" : "-", ctrlb.bit.LUPD,
                ctrlb.bit.ONESHOT, ctrlb.bit.IDXCMD, ctrlb.bit.CMD);
                
  TCC_FCTRLA_Type fctrl;
  fctrl.reg = tcc->FCTRLA.reg;
  Serial.printf("      FCTRLA=0x%x src=%d keep=%d qual=%d blank=%d restart=%d ",
                fctrl.reg, fctrl.bit.SRC, fctrl.bit.KEEP, fctrl.bit.QUAL, fctrl.bit.BLANK,
                fctrl.bit.RESTART);
  Serial.printf("halt=%d chsel=%d capture=%d blankpresc=%d ",
                fctrl.bit.HALT, fctrl.bit.CHSEL, fctrl.bit.CAPTURE, fctrl.bit.BLANKPRESC);
  Serial.printf("blankval=%d filterval=%d\n",
                fctrl.bit.BLANKVAL, fctrl.bit.FILTERVAL);
                
  fctrl.reg = tcc->FCTRLB.reg;
  Serial.printf("      FCTRLB=0x%x src=%d keep=%d qual=%d blank=%d restart=%d ",
                fctrl.reg, fctrl.bit.SRC, fctrl.bit.KEEP, fctrl.bit.QUAL, fctrl.bit.BLANK,
                fctrl.bit.RESTART);
  Serial.printf("halt=%d chsel=%d capture=%d blankpresc=%d ",
                fctrl.bit.HALT, fctrl.bit.CHSEL, fctrl.bit.CAPTURE, fctrl.bit.BLANKPRESC);
  Serial.printf("blankval=%d filterval=%d\n",
                fctrl.bit.BLANKVAL, fctrl.bit.FILTERVAL);
  
  TCC_WEXCTRL_Type wexctrl;
  wexctrl.reg = tcc->WEXCTRL.reg;
  Serial.printf("      WEXCTRL=0x%x otmx=%d dtie=[%d,%d,%d,%d], dtls=%d dths=%d\n",
                wexctrl.reg, wexctrl.bit.OTMX, wexctrl.bit.DTIEN0, wexctrl.bit.DTIEN1,
                wexctrl.bit.DTIEN2, wexctrl.bit.DTIEN3, wexctrl.bit.DTLS, wexctrl.bit.DTHS);
  
  TCC_DRVCTRL_Type drvctrl;
  drvctrl.reg = tcc->DRVCTRL.reg;
  Serial.printf("      DRVCTRL=0x%x nre=[%d,%d,%d,%d,%d,%d,%d,%d] ",
                drvctrl.reg, drvctrl.bit.NRE0, drvctrl.bit.NRE1, drvctrl.bit.NRE2, drvctrl.bit.NRE3,
                drvctrl.bit.NRE4, drvctrl.bit.NRE5, drvctrl.bit.NRE6, drvctrl.bit.NRE7);
  Serial.printf("nrv=[%d,%d,%d,%d,%d,%d,%d,%d] ",
                drvctrl.bit.NRV0, drvctrl.bit.NRV1, drvctrl.bit.NRV2, drvctrl.bit.NRV3,
                drvctrl.bit.NRV4, drvctrl.bit.NRV5, drvctrl.bit.NRV6, drvctrl.bit.NRV7);
  Serial.printf("inven=[%d,%d,%d,%d,%d,%d,%d,%d] filterval0=%d filterval1=%d\n",
                drvctrl.bit.INVEN0, drvctrl.bit.INVEN1, drvctrl.bit.INVEN2, drvctrl.bit.INVEN3,
                drvctrl.bit.INVEN4, drvctrl.bit.INVEN5, drvctrl.bit.INVEN6, drvctrl.bit.INVEN7,
                drvctrl.bit.FILTERVAL0, drvctrl.bit.FILTERVAL1);

  TCC_DBGCTRL_Type dbgctrl;
  dbgctrl.reg = tcc->DBGCTRL.reg;
  Serial.printf("      DBGCTRL=0x%x dbgrun=%d fddbg=%d\n",
                dbgctrl.reg, dbgctrl.bit.DBGRUN, dbgctrl.bit.FDDBD);
  
  TCC_EVCTRL_Type evctrl;
  evctrl.reg = tcc->EVCTRL.reg;
  Serial.printf("      EVCTRL=0x%x evact0=%d evact1=%d cntsel=%d ovfeo=%d trgeo=%d cnteo=%d ",
                evctrl.reg, evctrl.bit.EVACT0, evctrl.bit.EVACT1, evctrl.bit.CNTSEL,
                evctrl.bit.OVFEO, evctrl.bit.TRGEO, evctrl.bit.CNTEO);
  Serial.printf("tcinv0=%d tcinv1=%d tcei0=%d tcei1=%d ",
                evctrl.bit.TCINV0, evctrl.bit.TCINV1, evctrl.bit.TCEI0, evctrl.bit.TCEI1);
  Serial.printf("mcei=[%d,%d,%d,%d,%d,%d] mceo=[%d,%d,%d,%d,%d,%d]\n",
                evctrl.bit.MCEI0, evctrl.bit.MCEI1, evctrl.bit.MCEI2, evctrl.bit.MCEI3,
                evctrl.bit.MCEI4, evctrl.bit.MCEI5, evctrl.bit.MCEO0, evctrl.bit.MCEO1,
                evctrl.bit.MCEO2, evctrl.bit.MCEO3, evctrl.bit.MCEO4, evctrl.bit.MCEO5);

