icosalogic/SAMD51_Dumpster/SAMD51_Dumpster.cpp
  TCC_INTENSET_Type intenset;
  intenset.reg = tcc->INTENSET.reg;
  Serial.printf("      INTENSET=0x%x  ovf=%d trg=%d cnt=%d err=%d ufs=%d dfs=%d ",
                intenset.reg, intenset.bit.OVF, intenset.bit.TRG, intenset.bit.CNT,
                intenset.bit.ERR, intenset.bit.UFS, intenset.bit.DFS);
  Serial.printf("faulta=%d faultb=%d fault0=%d fault1=%d, mc=[%d,%d,%d,%d,%d,%d]\n",
                intenset.bit.FAULTA, intenset.bit.FAULTB, intenset.bit.FAULT0, intenset.bit.FAULT1,
                intenset.bit.MC0, intenset.bit.MC1, intenset.bit.MC2, intenset.bit.MC3,
                intenset.bit.MC4, intenset.bit.MC5);

  TCC_INTFLAG_Type intflag;
  intflag.reg = tcc->INTFLAG.reg;
  Serial.printf("      INTFLAG=0x%x  ovf=%d trg=%d cnt=%d err=%d ufs=%d dfs=%d ",
                intflag.reg, intflag.bit.OVF, intflag.bit.TRG, intflag.bit.CNT,
                intflag.bit.ERR, intflag.bit.UFS, intflag.bit.DFS);
  Serial.printf("faulta=%d faultb=%d fault0=%d fault1=%d, mc=[%d,%d,%d,%d,%d,%d]\n",
                intflag.bit.FAULTA, intflag.bit.FAULTB, intflag.bit.FAULT0, intflag.bit.FAULT1,
                intflag.bit.MC0, intflag.bit.MC1, intflag.bit.MC2, intflag.bit.MC3,
                intflag.bit.MC4, intflag.bit.MC5);

  TCC_STATUS_Type status;
  status.reg = tcc->STATUS.reg;
  Serial.printf("      STATUS=0x%x  stop=%d idx=%d ufs=%d dfs=%d slave=%d pattbufv=%d perbufv=%d ",
                status.reg, status.bit.STOP, status.bit.IDX, status.bit.UFS, status.bit.DFS,
                status.bit.SLAVE, status.bit.PATTBUFV, status.bit.PERBUFV);
  Serial.printf("faultin[AB01]=[%d,%d,%d,%d] fault[AB01]=[%d,%d,%d,%d] ",
                status.bit.FAULTAIN, status.bit.FAULTBIN, status.bit.FAULT0IN, status.bit.FAULT1IN,
                status.bit.FAULTA, status.bit.FAULTB, status.bit.FAULT0, status.bit.FAULT1);
  Serial.printf("ccbufv=[%d,%d,%d,%d,%d,%d] cmp=[%d,%d,%d,%d,%d,%d]\n",
                status.bit.CCBUFV0, status.bit.CCBUFV1, status.bit.CCBUFV2, status.bit.CCBUFV3,
                status.bit.CCBUFV4, status.bit.CCBUFV5, status.bit.CMP0, status.bit.CMP1,
                status.bit.CMP2, status.bit.CMP3, status.bit.CMP4, status.bit.CMP5);

  TCC_PATT_Type patt;
  patt.reg = tcc->PATT.reg;
  Serial.printf("      PATT=0x%x     pge=[%d,%d,%d,%d,%d,%d,%d,%d] pgv=[%d,%d,%d,%d,%d,%d,%d,%d]\n",
                patt.reg, patt.bit.PGE0, patt.bit.PGE1, patt.bit.PGE2, patt.bit.PGE3,
                patt.bit.PGE4, patt.bit.PGE5, patt.bit.PGE6, patt.bit.PGE7,
                patt.bit.PGE0, patt.bit.PGE1, patt.bit.PGE2, patt.bit.PGE3,
                patt.bit.PGE4, patt.bit.PGE5, patt.bit.PGE6, patt.bit.PGE7);

  patt.reg = tcc->PATTBUF.reg;
  Serial.printf("      PATTBUF=0x%x  pge=[%d,%d,%d,%d,%d,%d,%d,%d] pgv=[%d,%d,%d,%d,%d,%d,%d,%d]\n",
                patt.reg, patt.bit.PGE0, patt.bit.PGE1, patt.bit.PGE2, patt.bit.PGE3,
                patt.bit.PGE4, patt.bit.PGE5, patt.bit.PGE6, patt.bit.PGE7,
                patt.bit.PGE0, patt.bit.PGE1, patt.bit.PGE2, patt.bit.PGE3,
                patt.bit.PGE4, patt.bit.PGE5, patt.bit.PGE6, patt.bit.PGE7);

  TCC_WAVE_Type wave;
  wave.reg = tcc->WAVE.reg;
  Serial.printf("      WAVE=0x%x  wavegen=%d [%s] ramp=%d ciperen=%d ciccen=[%d,%d,%d,%d] ",
                wave.reg, wave.bit.WAVEGEN, tccWaveGenNames[wave.bit.WAVEGEN], wave.bit.RAMP,
                wave.bit.CIPEREN, wave.bit.CICCEN0, wave.bit.CICCEN1, wave.bit.CICCEN2,
                wave.bit.CICCEN3);
  Serial.printf("pol=[%d,%d,%d,%d,%d,%d] swap=[%d,%d,%d,%d]\n",
                wave.bit.POL0, wave.bit.POL1, wave.bit.POL2, wave.bit.POL3, wave.bit.POL4,
                wave.bit.POL5, wave.bit.SWAP0, wave.bit.SWAP1, wave.bit.SWAP2, wave.bit.SWAP3);
                
  TCC_COUNT_Type count;
  count.reg = tcc->COUNT.reg;
  Serial.printf("      COUNT=0x%x  count=%d\n", count.reg, count.reg);

  TCC_CC_Type xx;
  TCC_CCBUF_Type xxbuf;
  
  // TODO: Fix the following formatting to handle dithering
  
  xx.reg = tcc->PER.reg;
  xxbuf.reg = tcc->PERBUF.reg;
  Serial.printf("      PER=0x%x  val=%d BUF val=%d\n", xx.reg, xx.bit.CC, xxbuf.bit.CCBUF);
  
  for (int i = 0; i < ccNum; i++) {
    xx.reg = tcc->CC[i].reg;
    xxbuf.reg = tcc->CCBUF[i].reg;
    Serial.printf("      CC%d=0x%x  val=%d BUF val=%d\n", i, xx.reg, xx.bit.CC, xxbuf.bit.CCBUF);
  }
  
}
#endif

/*
 * Dumps all the TC instances.
 */
void SAMD51_Dumpster::dumpTC(const char* msg) {
  Serial.printf("\nTC:");
  if (msg != NULL) {
    Serial.printf(" %s", msg);
  }
  Serial.printf("\n");

  for (int i = 0; i < TC_INST_NUM; i++) {
    dumpTcInstance(i);
  }
}

/*
 * Dump most registers of a TC instance.
 */
void SAMD51_Dumpster::dumpTcInstance(int n) {
  if (n < 0 || n >= TC_INST_NUM) {
    Serial.printf("TC instance num out of range: n=%d\n", n);
    return;
  }
  Tc* tcInstances[] = TC_INSTS;
  Tc* tc = tcInstances[n];
  uint8_t en = tc->COUNT16.CTRLA.bit.ENABLE;
  if (en || verbose) {
    Serial.printf("\nTC%d:\n", n);
    Serial.printf("  CTRLA 0x%x (swrst=%d en=%d mode=%d presync=%d runstdby=%d ondemand=%d\n",
                  tc->COUNT16.CTRLA.reg, tc->COUNT16.CTRLA.bit.SWRST, en, tc->COUNT16.CTRLA.bit.MODE,
                  tc->COUNT16.CTRLA.bit.PRESCSYNC, tc->COUNT16.CTRLA.bit.RUNSTDBY, tc->COUNT16.CTRLA.bit.ONDEMAND);
    uint8_t tmp8 = tc->COUNT16.CTRLA.bit.PRESCALER;
    Serial.printf("              prescalar=%d [%d] alock=%d capten=%d,%d copen=%d,%d captmode=%d,%d\n",
                  tmp8, tcPrescalars[tmp8], tc->COUNT16.CTRLA.bit.ALOCK,
                  tc->COUNT16.CTRLA.bit.CAPTEN0, tc->COUNT16.CTRLA.bit.CAPTEN1,
                  tc->COUNT16.CTRLA.bit.COPEN0, tc->COUNT16.CTRLA.bit.COPEN1,
                  tc->COUNT16.CTRLA.bit.CAPTMODE0, tc->COUNT16.CTRLA.bit.CAPTMODE1);
    Serial.printf("  CTRLB 0x%x (dir=%d lupd=%d oneshot=%d cmd=%d)\n",
                  tc->COUNT16.CTRLBSET.reg, tc->COUNT16.CTRLBSET.bit.DIR, tc->COUNT16.CTRLBSET.bit.LUPD,
                  tc->COUNT16.CTRLBSET.bit.ONESHOT, tc->COUNT16.CTRLBSET.bit.CMD);
    Serial.printf("  EVCTRL 0x%x (evact=%d tcinv=%d tcei=%d ovfeo=%d mceo0=%d mceo1=%d)\n",
                  tc->COUNT16.EVCTRL.reg, tc->COUNT16.EVCTRL.bit.EVACT, tc->COUNT16.EVCTRL.bit.TCINV,
                  tc->COUNT16.EVCTRL.bit.TCEI, tc->COUNT16.EVCTRL.bit.OVFEO,
                  tc->COUNT16.EVCTRL.bit.MCEO0, tc->COUNT16.EVCTRL.bit.MCEO1);
    Serial.printf("  INTENSET 0x%x (ovf=%d err=%d mc0=%d mc1=%d)\n",
                  tc->COUNT16.INTENSET.reg, tc->COUNT16.INTENSET.bit.OVF, tc->COUNT16.INTENSET.bit.ERR,
                  tc->COUNT16.INTENSET.bit.MC0, tc->COUNT16.INTENSET.bit.MC1);
    Serial.printf("  INTFLAG 0x%x (ovf=%d err=%d mc0=%d mc1=%d)\n",
                  tc->COUNT16.INTFLAG.reg, tc->COUNT16.INTFLAG.bit.OVF, tc->COUNT16.INTFLAG.bit.ERR,
                  tc->COUNT16.INTFLAG.bit.MC0, tc->COUNT16.INTFLAG.bit.MC1);
    Serial.printf("  STATUS 0x%x (stop=%d slave=%d perbufv=%d ccbufv0=%d ccbufv1=%d)\n",
                  tc->COUNT16.STATUS.reg, tc->COUNT16.STATUS.bit.STOP, tc->COUNT16.STATUS.bit.SLAVE,
                  tc->COUNT16.STATUS.bit.PERBUFV, tc->COUNT16.STATUS.bit.CCBUFV0, tc->COUNT16.STATUS.bit.CCBUFV1);
    Serial.printf("  WAVE 0x%x (%s)\n", tc->COUNT16.WAVE.reg, tcWaves[tc->COUNT16.WAVE.bit.WAVEGEN]);
    Serial.printf("  DRVCTRL 0x%x (inven0=%d inven1=%d)\n",
                  tc->COUNT16.DRVCTRL.reg, tc->COUNT16.DRVCTRL.bit.INVEN0, tc->COUNT16.DRVCTRL.bit.INVEN1);
    Serial.printf("  DBGCTRL 0x%x (dbgrun=%d)\n",
                  tc->COUNT16.DBGCTRL.reg, tc->COUNT16.DBGCTRL.bit.DBGRUN);
    Serial.printf("  COUNT 0x%x (%d)  CC0 0x%x (%d) CC1 0x%x (%d)  CCBUF0 0x%x (%d) CCBUF1 0x%x (%d)\n\n",
                  tc->COUNT16.COUNT.reg, tc->COUNT16.COUNT.reg,
                  tc->COUNT16.CC[0].reg, tc->COUNT16.CC[0].reg,
                  tc->COUNT16.CC[1].reg, tc->COUNT16.CC[1].reg,
                  tc->COUNT16.CCBUF[0].reg, tc->COUNT16.CCBUF[0].reg,
                  tc->COUNT16.CCBUF[1].reg, tc->COUNT16.CCBUF[1].reg);
  }
}
  
