icosalogic/SAMD51_Dumpster/SAMD51_Dumpster.cpp
/*
 * Dumps the EVSYS entries.
 */
void SAMD51_Dumpster::dumpEVSYS(const char* msg) {
  Serial.printf("\nEVSYS: ");
  if (msg != NULL) {
    Serial.printf(" %s", msg);
  }
  Serial.printf("\n");

  EVSYS_CTRLA_Type ctrla;
  ctrla.reg = EVSYS->CTRLA.reg;
  EVSYS_PRICTRL_Type prictrl;
  prictrl.reg = EVSYS->PRICTRL.reg;
  Serial.printf("EVSYS: CNTRLA=0x%x swrst=%d PRICTRL=0x%x pri=%d rren=%d\n",
                 ctrla.reg, ctrla.bit.SWRST, prictrl.reg, prictrl.bit.PRI, prictrl.bit.RREN);

  EVSYS_INTPEND_Type intpend;
  intpend.reg = EVSYS->INTPEND.reg;
  Serial.printf("       INTPEND=0x%x id=%d ovr=%d evd=%d ready=%d busy=%d\n",
                intpend.reg, intpend.bit.ID, intpend.bit.OVR, intpend.bit.EVD, intpend.bit.READY,
                intpend.bit.BUSY);
  
  EVSYS_INTSTATUS_Type intstatus;
  intstatus.reg = EVSYS->INTSTATUS.reg;
  Serial.printf("       INTSTATUS=0x%03x ch=[%d,%d,%d,%d, %d,%d,%d,%d, %d,%d,%d,%d]\n",
                intstatus.reg,
                intstatus.bit.CHINT0, intstatus.bit.CHINT1, intstatus.bit.CHINT2, 
                intstatus.bit.CHINT3, intstatus.bit.CHINT4, intstatus.bit.CHINT5,
                intstatus.bit.CHINT6, intstatus.bit.CHINT7, intstatus.bit.CHINT8, 
                intstatus.bit.CHINT9, intstatus.bit.CHINT10, intstatus.bit.CHINT11);
  
  EVSYS_BUSYCH_Type busych;
  busych.reg = EVSYS->BUSYCH.reg;
  Serial.printf("       BUSYCH=0x%03x    ch=[%d,%d,%d,%d, %d,%d,%d,%d, %d,%d,%d,%d]\n",
                busych.reg,
                busych.bit.BUSYCH0, busych.bit.BUSYCH1, busych.bit.BUSYCH2, 
                busych.bit.BUSYCH3, busych.bit.BUSYCH4, busych.bit.BUSYCH5, 
                busych.bit.BUSYCH6, busych.bit.BUSYCH7, busych.bit.BUSYCH8, 
                busych.bit.BUSYCH9, busych.bit.BUSYCH10, busych.bit.BUSYCH11);

  EVSYS_READYUSR_Type readyusr;
  readyusr.reg = EVSYS->READYUSR.reg;
  Serial.printf("       READYUSR=0x%03x  ch=[%d,%d,%d,%d, %d,%d,%d,%d, %d,%d,%d,%d]\n",
                readyusr.reg,
                readyusr.bit.READYUSR0, readyusr.bit.READYUSR1, readyusr.bit.READYUSR2, 
                readyusr.bit.READYUSR3, readyusr.bit.READYUSR4, readyusr.bit.READYUSR5, 
                readyusr.bit.READYUSR6, readyusr.bit.READYUSR7, readyusr.bit.READYUSR8, 
                readyusr.bit.READYUSR9, readyusr.bit.READYUSR10, readyusr.bit.READYUSR11);
                
  for (int i = 0; i < EVSYS_CHANNELS; i++) {
    dumpEvChannel(i);
  }
  
  for (int i = 0; i < EVSYS_USERS; i++) {
    dumpEvUser(i);
  }
}

/*
 * Dumps a single event channel.
 */
void SAMD51_Dumpster::dumpEvChannel(int chNum) {
  EvsysChannel *ch = &(EVSYS->Channel[chNum]);
  
  EVSYS_CHANNEL_Type channel;
  channel.reg = ch->CHANNEL.reg;
  
  if (channel.bit.EVGEN > 0 || verbose) {
    Serial.printf("       CH[%2d] evgen=%d [%s] path=%d [%d] edgsel=%d runstdby=%d ondemand=%d ",
                  chNum, channel.bit.EVGEN, evGenNames[channel.bit.EVGEN], channel.bit.PATH,
                  evPathNames[channel.bit.PATH], channel.bit.EDGSEL, channel.bit.RUNSTDBY,
                  channel.bit.ONDEMAND);
                
    if (chNum < 12) {
      EVSYS_CHINTENSET_Type chintset;
      chintset.reg = ch->CHINTENSET.reg;
      EVSYS_CHINTFLAG_Type chintflag;
      chintflag.reg = ch->CHINTFLAG.reg;
      EVSYS_CHSTATUS_Type chstatus;
      chstatus.reg = ch->CHSTATUS.reg;
      Serial.printf("intset[ovr=%d evd=%d] intflag[ovr=%d evd=%d] status[rdyusr=%d busych=%d]",
                    chintset.bit.OVR, chintset.bit.EVD, chintflag.bit.OVR, chintflag.bit.EVD,
                    chstatus.bit.RDYUSR, chstatus.bit.BUSYCH);
    }
    Serial.printf("\n");
    int foundUser = 0;
    for (int i = 0; i < EVSYS_USERS; i++) {
      EVSYS_USER_Type user;
      user.reg = EVSYS->USER[i].reg;
      if (user.bit.CHANNEL == chNum) {
        char prefix[32] = ", ";
        if (!foundUser) {
          foundUser = 1;
          strcpy(prefix, "           USERS: ");
        }
        Serial.printf("%s%s", prefix, evUserNames[i]);
      }
      if (foundUser) {
        Serial.printf("\n");
      }
    }
  }
}

/*
 * Dumps a single event user.
 */
void SAMD51_Dumpster::dumpEvUser(int userNum) {
  EVSYS_USER_Type user;
  user.reg = EVSYS->USER[userNum].reg;
  if (user.bit.CHANNEL > 0 || verbose) {
    Serial.printf("       USER %d [%s] channel %d\n",
                  userNum, evUserNames[userNum], user.bit.CHANNEL);
  }
}

/*
 * Dumps the DMAC (Direct Memory Access Controller).
 */
void SAMD51_Dumpster::dumpDMAC(const char* msg) {
  Serial.printf("\nDMAC:");
  if (msg != NULL) {
    Serial.printf(" %s", msg);
  }
  Serial.printf("\n");

  DMAC_CTRL_Type ctrl;
  ctrl.reg = DMAC->CTRL.reg;
  Serial.printf("DMAC: CNTRL=0x%x swrst=%d en=%d lvlen=[%d,%d,%d,%d]\n",
                 ctrl.reg, ctrl.bit.SWRST, ctrl.bit.DMAENABLE, ctrl.bit.LVLEN0, ctrl.bit.LVLEN1,
                 ctrl.bit.LVLEN2, ctrl.bit.LVLEN3);

  DMAC_CRCCTRL_Type crcctrl;
  crcctrl.reg = DMAC->CRCCTRL.reg;
  Serial.printf("      CRCCTRL=0x%x beatsize=%d [%d bytes] poly=%d [%s] ",
                 crcctrl.reg, crcctrl.bit.CRCBEATSIZE, beatSizes[crcctrl.bit.CRCBEATSIZE],
                 crcctrl.bit.CRCPOLY, crcPolyNames[crcctrl.bit.CRCPOLY]);
  Serial.printf("src=%d [%s] mode=%d [%s]\n",
                 crcctrl.bit.CRCSRC, crcSrcNames[crcctrl.bit.CRCSRC], crcctrl.bit.CRCMODE,
                 crcModeNames[crcctrl.bit.CRCMODE]);

  DMAC_CRCDATAIN_Type datain;
  DMAC_CRCCHKSUM_Type chksum;
  DMAC_CRCSTATUS_Type status;
  datain.reg = DMAC->CRCDATAIN.reg;
  chksum.reg = DMAC->CRCCHKSUM.reg;
  status.reg = DMAC->CRCSTATUS.reg;
  Serial.printf("      CRCSTATUS=0x%x busy=%d zero=%d err=%d CRCDATAIN=0x%x CRCCHKSUM=0x%x\n",
                 status.reg, status.bit.CRCBUSY, status.bit.CRCZERO, status.bit.CRCERR,
                 datain.bit.CRCDATAIN, chksum.bit.CRCCHKSUM);

  DMAC_DBGCTRL_Type dbgctrl;
  dbgctrl.reg = DMAC->DBGCTRL.reg;
  Serial.printf("      DBGCTRL=0x%x dbgrun=%d\n", dbgctrl.reg, dbgctrl.bit.DBGRUN);
  
  DMAC_SWTRIGCTRL_Type swtrig;
  swtrig.reg = DMAC->SWTRIGCTRL.reg;
  Serial.printf("      SWTRIGCTRL=0x%x ch=[", swtrig.reg);
  dumpArray(swtrig.reg, 32);
  Serial.printf("]\n");

  DMAC_PRICTRL0_Type prictrl;
  prictrl.reg = DMAC->PRICTRL0.reg;
  Serial.printf("      PRICTRL=0x%x ", prictrl.reg);
  Serial.printf("lvlpri0=%d qos0=%d [%s] rren0=%d ",
                prictrl.bit.LVLPRI0, prictrl.bit.QOS0, priQosNames[prictrl.bit.QOS0],
                prictrl.bit.RRLVLEN0);
  Serial.printf("lvlpri1=%d qos1=%d [%s] rren1=%d\n",
                prictrl.bit.LVLPRI1, prictrl.bit.QOS1, priQosNames[prictrl.bit.QOS1],
                prictrl.bit.RRLVLEN1);
  Serial.printf("             lvlpri2=%d qos2=%d [%s] rren2=%d ",
                prictrl.bit.LVLPRI2, prictrl.bit.QOS2, priQosNames[prictrl.bit.QOS2],
                prictrl.bit.RRLVLEN2);
  Serial.printf("lvlpri3=%d qos3=%d [%s] rren3=%d\n",
                prictrl.bit.LVLPRI3, prictrl.bit.QOS3, priQosNames[prictrl.bit.QOS3],
                prictrl.bit.RRLVLEN3);

  DMAC_INTPEND_Type intpend;
  intpend.reg = DMAC->INTPEND.reg;
  Serial.printf("      INTPEND=0x%x id=%d terr=%d tcmpl=%d susp=%d crcerr=%d ferr=%d busy=%d pend=%d\n",
                intpend.reg, intpend.bit.ID, intpend.bit.TERR, intpend.bit.TCMPL, intpend.bit.SUSP,
                intpend.bit.CRCERR, intpend.bit.FERR, intpend.bit.BUSY, intpend.bit.PEND);
  
  DMAC_INTSTATUS_Type intstatus;
  intstatus.reg = DMAC->INTSTATUS.reg;
  Serial.printf("      INTSTATUS=0x%x ch=[", intstatus.reg);
  dumpArray(intstatus.reg, 32);
  Serial.printf("]\n");

  DMAC_BUSYCH_Type busych;
  busych.reg = DMAC->BUSYCH.reg;
  Serial.printf("      BUSYCH=0x%x ch=[", busych.reg);
  dumpArray(busych.reg, 32);
  Serial.printf("]\n");

  DMAC_PENDCH_Type pendch;
  pendch.reg = DMAC->PENDCH.reg;
  Serial.printf("      PENDCH=0x%x ch=[", pendch.reg);
  dumpArray(pendch.reg, 32);
  Serial.printf("]\n");

  DMAC_ACTIVE_Type active;
  active.reg = DMAC->ACTIVE.reg;
  Serial.printf("      ACTIVE=0x%x lvlex=[%d,%d,%d,%d] id=%d abusy=%d btcnt=%d\n",
                active.reg, active.bit.LVLEX0, active.bit.LVLEX1, active.bit.LVLEX2,
                active.bit.LVLEX3, active.bit.ID, active.bit.ABUSY, active.bit.BTCNT);
  
