icosalogic/SAMD51_Dumpster/SAMD51_Dumpster.cpp
  DMAC_BASEADDR_Type baseaddr;
  DMAC_WRBADDR_Type wrbaddr;
  baseaddr.reg = DMAC->BASEADDR.reg;
  wrbaddr.reg = DMAC->WRBADDR.reg;
  Serial.printf("      BASEADDR=0x%x WRBADDR=0x%x\n", baseaddr.reg, wrbaddr.reg);

  for (int i = 0; i < DMAC_CH_NUM; i++) {
    dumpDmacChannel(i);
  }
}

/*
 * Dumps a single DMAC channel.
 */
void SAMD51_Dumpster::dumpDmacChannel(int chNum) {
  DmacChannel *ch = &(DMAC->Channel[chNum]);
  
  DMAC_CHCTRLA_Type ctrla;
  ctrla.reg = ch->CHCTRLA.reg;
  
  if (ctrla.bit.ENABLE || verbose) {
    Serial.printf("        CH[%2d] CTRLA=0x%x swrst=%d en=%d runstdby=%d trigsrc=%d [%s] ",
                  chNum, ctrla.reg, ctrla.bit.SWRST, ctrla.bit.ENABLE, ctrla.bit.RUNSTDBY,
                  ctrla.bit.TRIGSRC, trigSrcNames[ctrla.bit.TRIGSRC]);
    Serial.printf("trigact=%d [%s] burstlen=%d [%d] threshold=%d [%d]\n",
                  ctrla.bit.TRIGACT, trigActNames[ctrla.bit.TRIGACT], ctrla.bit.BURSTLEN,
                  ctrla.bit.BURSTLEN + 1, ctrla.bit.THRESHOLD, thresholdSizes[ctrla.bit.THRESHOLD]);

    DMAC_CHCTRLB_Type ctrlb;
    ctrlb.reg = ch->CHCTRLB.reg;
    Serial.printf("              CTRLB=0x%x cmd=%d [%s]\n",
                  ctrlb.reg, ctrlb.bit.CMD, dmacCmdNames[ctrlb.bit.CMD]);

    DMAC_CHPRILVL_Type prilvl;
    DMAC_CHEVCTRL_Type evctrl;
    prilvl.reg = ch->CHPRILVL.reg;
    evctrl.reg = ch->CHEVCTRL.reg;
    Serial.printf("              CHPRILVL=0x%x EVCTRL=0x%x evact=%d [%s] evomode=%d [%s] ",
                  prilvl.reg, evctrl.reg, evctrl.bit.EVACT, dmacChEvActNames[evctrl.bit.EVACT],
                  evctrl.bit.EVOMODE, dmacChEvOutModeNames[evctrl.bit.EVOMODE]);
    Serial.printf("evie=%d evoe=%d\n", evctrl.bit.EVIE, evctrl.bit.EVOE);

    DMAC_CHINTENSET_Type inten;
    DMAC_CHINTFLAG_Type intflag;
    inten.reg = ch->CHINTENSET.reg;
    intflag.reg = ch->CHINTFLAG.reg;
    Serial.printf("              CHINTEN=0x%x terr=%d tcmpl=%d susp=%d ",
                  inten.reg, inten.bit.TERR, inten.bit.TCMPL, inten.bit.SUSP);
    Serial.printf("CHINTFLAG=0x%x terr=%d tcmpl=%d susp=%d\n",
                  intflag.reg, intflag.bit.TERR, intflag.bit.TCMPL, intflag.bit.SUSP);

    DMAC_CHSTATUS_Type status;
    status.reg = ch->CHSTATUS.reg;
    Serial.printf("              CHSTATUS=0x%x pend=%d busy=%d ferr=%d crcerr=%d\n",
                  status.reg, status.bit.PEND, status.bit.BUSY, status.bit.FERR, status.bit.CRCERR);
  }
  
}
  
/*
 * Dumps a single DMAC descriptor.
 */
void SAMD51_Dumpster::dumpDmacDesc(DmacDescriptor* desc) {
  if (desc == NULL) {
    return;
  }
  
  DMAC_BTCTRL_Type btctrl;
  btctrl.reg = desc->BTCTRL.reg;
  Serial.printf("        DESC[0x%x] BTCTRL=0x%x valid=%d evosel=%d [%s] blockact=%d [%s] ",
                desc, btctrl.reg, btctrl.bit.VALID,
                btctrl.bit.EVOSEL, dmacDescEvoSelNames[btctrl.bit.EVOSEL],
                btctrl.bit.BLOCKACT, dmacDescBlkActNames[btctrl.bit.BLOCKACT]);
  Serial.printf("beatsize=%d [%s bytes] srcinc=%d dstinc=%d stepsel=%d stepsize=%d [%d]\n",
                btctrl.bit.BEATSIZE, beatSizes[btctrl.bit.BEATSIZE], btctrl.bit.SRCINC,
                btctrl.bit.DSTINC, btctrl.bit.STEPSEL, dmacStepSelNames[btctrl.bit.STEPSEL],
                btctrl.bit.STEPSIZE, powersOf2[btctrl.bit.STEPSIZE]);
                
  DMAC_BTCNT_Type btcnt;
  DMAC_SRCADDR_Type srcaddr;
  DMAC_DSTADDR_Type dstaddr;
  DMAC_DESCADDR_Type descaddr;
  btcnt.reg = desc->BTCNT.reg;
  srcaddr.reg = desc->SRCADDR.reg;
  dstaddr.reg = desc->DSTADDR.reg;
  descaddr.reg = desc->DESCADDR.reg;
  Serial.printf("            BTCNT=0x%x [%d] SRCADDR=0x%x DSTADDR=0x%x DESCADDR=0x%x\n",
                btcnt.reg, btcnt.bit.BTCNT, srcaddr.reg, dstaddr.reg, descaddr.reg);
  
}

/*
 * Dumps a comma-separated list of bit values in array format.
 * Leaves an extra space after every 8th value, for better readability.
 */
void SAMD51_Dumpster::dumpArray(uint32_t val, int cnt) {
  for (int i = 1; i <= cnt; i++) {
    Serial.printf("%d", val & 0x1);
    val >>= 1;
    if (i < cnt) {
      Serial.printf(i % 8 == 0 ? ", " : ",");
    }
  }
}

/*
 * Dump the ADC instances.
 */
void SAMD51_Dumpster::dumpADC(const char* msg) {
  Serial.printf("\nADC:");
  if (msg != NULL) {
    Serial.printf(" %s", msg);
  }
  Serial.printf("\n");

  for (int i = 0; i < ADC_INST_NUM; i++) {
    dumpAdcInstance(i);
  }
}

/*
 * Dump the ADC instance with the given index.
 */
void SAMD51_Dumpster::dumpAdcInstance(int n) {
  Adc* adcs[ADC_INST_NUM] = ADC_INSTS;
  Adc* adc = adcs[n];
  
  ADC_CTRLA_Type ctrla;
  ctrla.reg = adc->CTRLA.reg;
  
  if (ctrla.bit.ENABLE || verbose) {
    Serial.printf("ADC%d: CNTRLA=0x%x swrst=%d en=%d dualsel=%d [%s] slaveen=%d ",
                  n, ctrla.reg, ctrla.bit.SWRST, ctrla.bit.ENABLE, ctrla.bit.DUALSEL,
                  adcDualSelNames[ctrla.bit.DUALSEL], ctrla.bit.SLAVEEN);
    Serial.printf("runstdby=%d ondemand=%d prescaler=%d [/%d] r2r=%d\n",
                  ctrla.bit.RUNSTDBY, ctrla.bit.ONDEMAND, ctrla.bit.PRESCALER,
                  adcPrescalerSizes[ctrla.bit.PRESCALER], ctrla.bit.R2R);
                  
    ADC_EVCTRL_Type evctrl;
    evctrl.reg = adc->EVCTRL.reg;
    Serial.printf("      EVCTRL=0x%x flushei=%d startei=%d flushinv=%d startinv=%d ",
                  evctrl.reg, evctrl.bit.FLUSHEI, evctrl.bit.STARTEI, evctrl.bit.FLUSHINV,
                  evctrl.bit.STARTINV);
    Serial.printf("resrdyeo=%d winmoneo=%d\n", evctrl.bit.RESRDYEO, evctrl.bit.WINMONEO);
    
    ADC_DBGCTRL_Type dbgctrl;
    dbgctrl.reg = adc->DBGCTRL.reg;
    Serial.printf("      DBGCTRL=0x%x dbgrun=%d\n", dbgctrl.reg, dbgctrl.bit.DBGRUN);
    
    ADC_INPUTCTRL_Type inputctrl;
    inputctrl.reg = adc->INPUTCTRL.reg;
    Serial.printf("      INPUTCTRL=0x%x muxpos=%d [%s] diffmode=%d muxneg=%d [%s] dseqstop=%d\n",
                  inputctrl.reg, inputctrl.bit.MUXPOS, adcMuxPosNames[inputctrl.bit.MUXPOS],
                  inputctrl.bit.DIFFMODE, inputctrl.bit.MUXNEG,
                  adcMuxNegNames[inputctrl.bit.MUXNEG], inputctrl.bit.DSEQSTOP);
    
