icosalogic/SAMD51_Dumpster/SAMD51_Dumpster.cpp
    ADC_CTRLB_Type ctrlb;
    ctrlb.reg = adc->CTRLB.reg;
    Serial.printf("      CTRLB=0x%x leftadj=%d freerun=%d corren=%d ressel=%d [%d] ",
                  ctrlb.reg, ctrlb.bit.LEFTADJ, ctrlb.bit.FREERUN, ctrlb.bit.CORREN,
                  ctrlb.bit.RESSEL, adcResSelSizes[ctrlb.bit.RESSEL]);
    Serial.printf("winmode=%d [%s] winss=%d\n",
                  ctrlb.bit.WINMODE, adcWinModeNames[ctrlb.bit.WINMODE], ctrlb.bit.WINSS);

    ADC_REFCTRL_Type refctrl;
    refctrl.reg = adc->REFCTRL.reg;
    Serial.printf("      REFCTRL=0x%x refsel=%d [%s] refcomp=%d\n",
                  refctrl.reg, refctrl.bit.REFSEL, adcRefSelNames[refctrl.bit.REFSEL],
                  refctrl.bit.REFCOMP);

    ADC_AVGCTRL_Type avgctrl;
    avgctrl.reg = adc->AVGCTRL.reg;
    Serial.printf("      AVGCTRL=0x%x samplenum=%d [%d samples] adjres=%d [%d]\n",
                  avgctrl.reg, avgctrl.bit.SAMPLENUM, powersOf2[avgctrl.bit.SAMPLENUM],
                  avgctrl.bit.ADJRES, powersOf2[avgctrl.bit.ADJRES]);

    ADC_SAMPCTRL_Type sampctrl;
    sampctrl.reg = adc->SAMPCTRL.reg;
    Serial.printf("      SAMPCTRL=0x%x samplen=%d offcomp=%d\n",
                  sampctrl.reg, sampctrl.bit.SAMPLEN, sampctrl.bit.OFFCOMP);

    ADC_WINLT_Type winlt;
    ADC_WINUT_Type winut;
    winlt.reg = adc->WINLT.reg;
    winut.reg = adc->WINUT.reg;
    Serial.printf("      WINLT=0x%x (%d) WINUT=0x%x (%d)\n",
                  winlt.reg, winlt.bit.WINLT, winut.reg, winut.bit.WINUT);

    ADC_GAINCORR_Type gaincorr;
    ADC_OFFSETCORR_Type offsetcorr;
    gaincorr.reg = adc->GAINCORR.reg;
    offsetcorr.reg = adc->OFFSETCORR.reg;
    Serial.printf("      GAINCORR=0x%x (%d) OFFSETCORR=0x%x (%d)\n",
                  gaincorr.reg, gaincorr.bit.GAINCORR, offsetcorr.reg, offsetcorr.bit.OFFSETCORR);

    ADC_SWTRIG_Type swtrig;
    swtrig.reg = adc->SWTRIG.reg;
    Serial.printf("      SWTRIG=0x%x flush=%d start=%d\n",
                  swtrig.reg, swtrig.bit.FLUSH, swtrig.bit.START);

    ADC_INTENSET_Type intenset;
    ADC_INTFLAG_Type intflag;
    intenset.reg = adc->INTENSET.reg;
    intflag.reg = adc->INTFLAG.reg;
    Serial.printf("      INTENSET=0x%x resrdy=%d overrun=%d winmon=%d\n",
                  intenset.reg, intenset.bit.RESRDY, intenset.bit.OVERRUN, intenset.bit.WINMON);
    Serial.printf("      INTFLAG=0x%x resrdy=%d overrun=%d winmon=%d\n",
                  intflag.reg, intflag.bit.RESRDY, intflag.bit.OVERRUN, intflag.bit.WINMON);

    ADC_STATUS_Type status;
    status.reg = adc->STATUS.reg;
    Serial.printf("      STATUS=0x%x adcbusy=%d wcc=%d\n",
                  status.reg, status.bit.ADCBUSY, status.bit.WCC);

    ADC_SYNCBUSY_Type syncbusy;
    syncbusy.reg = adc->SYNCBUSY.reg;
    Serial.printf("      SYNCBUSY=0x%x swrst=%d enable=%d inputctrl=%d ctrlb=%d refctrl=%d ",
                  syncbusy.reg, syncbusy.bit.SWRST, syncbusy.bit.ENABLE, syncbusy.bit.INPUTCTRL,
                  syncbusy.bit.CTRLB, syncbusy.bit.REFCTRL);
    Serial.printf("avgctrl=%d sampctrl=%d winlt=%d winut=%d gaincorr=%d offsetcorr=%d swtrig=%d\n",
                  syncbusy.bit.AVGCTRL, syncbusy.bit.SAMPCTRL, syncbusy.bit.WINLT,
                  syncbusy.bit.WINUT, syncbusy.bit.GAINCORR, syncbusy.bit.OFFSETCORR,
                  syncbusy.bit.SWTRIG);

    ADC_DSEQDATA_Type dseqdata;
    dseqdata.reg = adc->DSEQDATA.reg;
    Serial.printf("      DSEQDATA=0x%x (%d)\n", dseqdata.reg, dseqdata.bit.DATA);

    ADC_DSEQCTRL_Type dseqctrl;
    ADC_DSEQSTAT_Type dseqstat;
    dseqctrl.reg = adc->DSEQCTRL.reg;
    dseqstat.reg = adc->DSEQSTAT.reg;
    Serial.printf("      DSEQCTRL=0x%x inputctrl=%d ctrlb=%d refctrl=%d avgctrl=%d sampctrl=%d ",
                  dseqctrl.reg, dseqctrl.bit.INPUTCTRL, dseqctrl.bit.CTRLB, dseqctrl.bit.REFCTRL,
                  dseqctrl.bit.AVGCTRL, dseqctrl.bit.SAMPCTRL);
    Serial.printf("winlt=%d winut=%d gaincorr=%d offsetcorr=%d autostart=%d\n",
                  dseqctrl.bit.WINLT, dseqctrl.bit.WINUT, dseqctrl.bit.GAINCORR,
                  dseqctrl.bit.OFFSETCORR, dseqctrl.bit.AUTOSTART);
    Serial.printf("      DSEQSTAT=0x%x inputctrl=%d ctrlb=%d refctrl=%d avgctrl=%d sampctrl=%d ",
                  dseqstat.reg, dseqstat.bit.INPUTCTRL, dseqstat.bit.CTRLB, dseqstat.bit.REFCTRL,
                  dseqstat.bit.AVGCTRL, dseqstat.bit.SAMPCTRL);
    Serial.printf("winlt=%d winut=%d gaincorr=%d offsetcorr=%d busy=%d\n",
                  dseqstat.bit.WINLT, dseqstat.bit.WINUT, dseqstat.bit.GAINCORR,
                  dseqstat.bit.OFFSETCORR, dseqstat.bit.BUSY);

    // TODO: If DSEQ is configured, dump the contents of the registers at DSEQDATA.
    
    ADC_RESULT_Type result;
    ADC_RESS_Type ress;
    result.reg = adc->RESULT.reg;
    ress.reg = adc->RESS.reg;
    Serial.printf("      RESULT=0x%x (%d) RESS=0x%x (%d)\n",
                  result.reg, result.bit.RESULT, ress.reg, ress.bit.RESS);

    ADC_CALIB_Type calib;
    calib.reg = adc->CALIB.reg;
    Serial.printf("      CALIB=0x%x biascomp=%d biasr2r=%d biasrefbuf=%d\n",
                  calib.reg, calib.bit.BIASCOMP, calib.bit.BIASR2R, calib.bit.BIASREFBUF);
  }
}
